"""
문제1
    인터프리터 언어는 빠른 실행으로 코드에 대한 빠른 피드백을 기대할 수 있다.
    컴파일 언어는 소스 코드 전체가 한 번에 기계어로 번역되므로 빠른 실행 속도를 기대할 수 있다.
"""

"""
문제2
    정답에 맞는 언어 아무거나 구글에 검색해서 찾으면 됨. 아래는 예시
    인터프리터 언어: python, javascript, ruby
    컴파일 언어: C, rust, go
"""

"""
문제3
    C or C++, 자바, 파이썬
"""

"""
문제4
    1) 어떤 언어의 코드 전체를 기계어로 변환해주는 소프트웨어
    2) 컴파일러와 비슷하되, 한 줄씩 코드를 읽으며 실행하는 소프트웨어
    3) 고급 언어로 작성된 코드를 변환해서 가상머신이 이해할 수 있는 코드
    4) CPU 등의 컴퓨터 장치가 별다른 변환 과정 없이 바로 이해할 수 있는 언어. 언어나 환경에 상관없이 실행되는 모든 프로그래밍 언어가 최종적으로 기계어로 번역됨. 
"""
