"""
문제1
    수 연산을 할 수 있는 데이터 타입
"""

"""
문제2
    바로 숫자를 적으면 된다.
"""

"""
문제3
    +, -, *, /
"""

"""
문제4
    정수로 나누기, 나머지 기호를 의미한다.
    즉, a//b=a*r+c라는 수식을 가정할 때, c는 a%b로 얻을 수 있다.
"""

"""
문제5
    x=x+y
    x-=y
    x=x*y
    x/=y
"""

"""
문제6
    강타입 언어는 변수의 타입이 엄격하게 정의되어 타입 간 변환이 제한적이거나 명시적인 선언이 필요한 반면, 약타입 언어는 타입 간 자동 변환을 허용하여 더 유연하지만 예기치 않은 버그를 유발할 수 있다.
"""

"""
문제7
    int
"""

"""
문제8
    str
"""

"""
문제9
    주석은 코드 실행에 영향을 주지 않는 텍스트
    주로 인간이 알아보기 위해 사용함. //을 주석문 앞에 붙여서 사용함.
"""

"""
문제10
    파이썬에서는 여러 줄 주석이 존재하지 않기 때문에 각 줄마다 일일이 //을 붙여야 한다.
    굳이 여러 줄 주석을 만들고 싶으면 (쌍)따옴표 3쌍을 넣고 그 사이에 주석문을 적으면 된다. 
    이는 엄밀히 말해 아무 역할을 하지 않는 string을 만드는 것이라서 주석이라 보기에는 애매하다.
"""
