"""
문제1
    while
"""

"""
문제2
    for
"""

"""
문제3
    데이터를 효율적으로 저장, 관리, 처리하기 위한 데이터의 조직, 관리, 저장구조
"""

"""
문제4
    순서가 존재하는 데이터들의 목록.
    [객체1, 객체2] 방식으로 리스트를 만들 수 있다.
    리스트의 각 요소는 순서가 부여되어 있으며 리스트[순서] 형식으로 접근할 수 있다.
"""

"""
문제5
    딕셔너리가 대표적
"""

"""
문제6
    for 형식과 while 형식의 반복문.
    'for 반복변수 in 반복가능객체:' 형식으로 반복 블록을 만들 수 있다. 
    반복 가능 객체에서 원소가 차례대로 반복 변수에 들어가고, 반복 블록 안에 있는 코드가 동작한다. 이 과정을 반복 가능 객체에서 원소를 모두 사용할 때까지 지속한다.
    'while 조건문:' 형식으로 반복 블록을 만들 수 있다.
    조건문이 참이라면 반복 블록이 실행된다. 조건문이 거짓이라면 반복 블록이 더 이상 실행되지 않고 다음 코드로 넘어간다.
    반복 블록 안에서 조건문을 건드리는 구문이 없다면 무한 반복 코드가 될 수 있기에 주의해야 한다.
"""

"""
문제7
    예를 들어 3번 반복하는 반복문 안에 3번 반복하는 반복문이 또 들어가 있다면, 총 3*3번 반복하게 된다.
    중첩이 많이 될 수록 기하급수적으로 반복 횟수가 생기기에 이에 유의해야 한다.
"""