"""
문제1
    데이터를 입력 받아 메모리에 저장한 후, 저장된 데이터를 CPU가 연산 처리하여 결과를 다시 출력하는 방식으로 작동한다.
"""

"""
문제2
    1) central processing unit, 중앙 처리 장치. 컴퓨터 시스템을 통제하고 연산을 실행 및 처리하는 컴퓨터 핵심 제어 장치
    2) Random Access Memory. 사용자가 자유롭게 데이터를 쓰거나 지울 수 있고, 접근할 수 있는 기억장치. 대신 휘발성이므로 전원이 공급될 때만 작동함.
    3) Read only memory. 전원 유지와 상관 없이 데이터에 접근할 수 있으나(비휘발성), 삭제나 수정이 불가능한 기억장치
    4) 비활성 보조 기억장치로, 컴퓨터가 종료된 이후에도 저장되어야 하는 데이터를 저장하는데 사용. 강자성체 원반을 자기화시켜서 자기적 신호를 기록.
"""

"""
문제3
    프로그래밍 언어 상관 없이 모두 공통적으로 정의되는 큰 의미의 함수의 뜻은 "재사용 가능한 코드 블록"을 의미함.
    조금 더 구체화를 해보자면 함수는 특정 작업을 수행하거나, 값을 계산하기 위해 독립적으로 정의된 코드의 집합.
    파이썬 함수의 경우 모듈성, 재사용성, 추상화, 독립성을 가짐. 그 과정에서 인수를 받거나 반환값을 반환할 수 있음.
"""

"""
문제4
    print
"""

"""
문제5
    원래 IDLE에서는 객체를 입력만 해도 바로 출력함. 따라서 IDLE의 각 줄에 "안녕하세요!!", "반갑습니다. :)", "파이선 프로그래밍을 배우게 되어 무척 기쁩니다."를 입력하고 엔터만 눌러도 출력됨.
    만약 IDLE가 아닌, 범용적으로 출력 가능하게 하려면 print를 사용해야 함. 실행 가능한 코드는 아래에 있음.
"""
print("안녕하세요!!")
print("반갑습니다. :)")
print("파이선 프로그래밍을 배우게 되어 무척 기쁩니다.")

"""
문제6
    아무거나.
"""
